---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.FamilyFailures.InstMayCutMoreOrFewerHosts
source: html/c470f057-c3ac-63b6-d9e9-9d0925bb2257.htm
---
# Autodesk.Revit.DB.BuiltInFailures.FamilyFailures.InstMayCutMoreOrFewerHosts Property

Insert may be cutting fewer or more hosts than needed. The problem may be solved by forcing regeneration, e.g. by moving the insert out and back by a tiny distance in any direction.

## Syntax (C#)
```csharp
public static FailureDefinitionId InstMayCutMoreOrFewerHosts { get; }
```